# Pandas

In [1]:
import pandas as pd

In [47]:
# 데이터프레임 만들기
df = pd.DataFrame({
    "name": ["김찬규", "정재현", "정원주", "사석현"],
    "gender": [0, 1, 0, 0],
    "school": ["서울대학교", "서울대학교", "서울과학기술대학교", "한양대학교"],
    "major": ["경영학과", "지구과학교육학과", "시각디자인학과", "컴퓨터공학과"]
})
df.head()

  name  gender     school     major
0  김찬규       0      서울대학교      경영학과
1  정재현       1      서울대학교  지구과학교육학과
2  정원주       0  서울과학기술대학교   시각디자인학과
3  사석현       0      한양대학교    컴퓨터공학과

In [48]:
# 특정 컬럼만 가져올 수 있음
df["name"]

0    김찬규
1    정재현
2    정원주
3    사석현
Name: name, dtype: object

In [49]:
# 이런 식으로 필터링 가능
df[[True, True, False, False]]

  name  gender school     major
0  김찬규       0  서울대학교      경영학과
1  정재현       1  서울대학교  지구과학교육학과

In [53]:
# 컬럼 연산
df["gender"] == 0

0     True
1    False
2     True
3     True
Name: gender, dtype: bool

In [54]:
# 컬럼 연산을 통한 필터링
df[df["gender"] == 0]

  name  gender     school    major
0  김찬규       0      서울대학교     경영학과
2  정원주       0  서울과학기술대학교  시각디자인학과
3  사석현       0      한양대학교   컴퓨터공학과

In [56]:
# 특정 기준으로 데이터 정렬하기
df.sort_values(by="gender")

  name  gender     school     major
0  김찬규       0      서울대학교      경영학과
2  정원주       0  서울과학기술대학교   시각디자인학과
3  사석현       0      한양대학교    컴퓨터공학과
1  정재현       1      서울대학교  지구과학교육학과

In [57]:
# 하지만 정렬한 값이 저장되지는 않음!
df

  name  gender     school     major
0  김찬규       0      서울대학교      경영학과
1  정재현       1      서울대학교  지구과학교육학과
2  정원주       0  서울과학기술대학교   시각디자인학과
3  사석현       0      한양대학교    컴퓨터공학과

In [59]:
# 저장하려면 이렇게
df = df.sort_values(by="gender")
# df.sort_values(by="gender", inplace=True)  # 이것도 가능
df

  name  gender     school     major
0  김찬규       0      서울대학교      경영학과
2  정원주       0  서울과학기술대학교   시각디자인학과
3  사석현       0      한양대학교    컴퓨터공학과
1  정재현       1      서울대학교  지구과학교육학과

In [60]:
# 파일 불러오기
kor_demo = pd.read_csv("data/kor_demographic.csv")
kor_demo.head()

   idx name  gender  height  weight
0    0  사수현       0  169.81   78.36
1    1  천영웅       1  160.28   52.59
2    2  고재지       1  165.44   52.64
3    3  천정웅       0  175.91   70.91
4    4  부영영       1  165.41   46.51

In [61]:
# 파일 불러오기
kor_score = pd.read_csv("data/kor_score.csv")
kor_score.head()

   idx name  score
0    0  사수현     49
1    1  천영웅     58
2    2  고재지     65
3    3  천정웅     55
4    4  부영영     61

In [44]:
# TODO: kor_demo와 kor_score를 합쳐보자! (join 함수)

In [45]:
# TODO: kor와 us를 합쳐보자! (concat 함수)

In [62]:
# TODO: 합친 데이터 엑셀로 만들어보자! (to_csv, to_excel 함수)

이제 모르는 것이 있다면 구글에 검색하면 된다!

*E.O.D.*